; ModuleID = 'hello.bc'
source_filename = "hello.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.EFI_SYSTEM_TABLE = type { %struct.EFI_TABLE_HEADER, i16*, i32, i8*, %struct._EFI_SIMPLE_TEXT_INPUT_PROTOCOL*, i8*, %struct._EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL*, i8*, %struct._EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL*, %struct.EFI_RUNTIME_SERVICES*, %struct.EFI_BOOT_SERVICES*, i32, %struct.EFI_CONFIGURATION_TABLE* }
%struct.EFI_TABLE_HEADER = type { i64, i32, i32, i32, i32 }
%struct._EFI_SIMPLE_TEXT_INPUT_PROTOCOL = type { i32 (%struct._EFI_SIMPLE_TEXT_INPUT_PROTOCOL*, i8)*, i32 (%struct._EFI_SIMPLE_TEXT_INPUT_PROTOCOL*, %struct.EFI_INPUT_KEY*)*, i8* }
%struct.EFI_INPUT_KEY = type { i16, i16 }
%struct._EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL = type { i32 (%struct._EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL*, i8)*, i32 (%struct._EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL*, i16*)*, i32 (%struct._EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL*, i16*)*, i32 (%struct._EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL*, i32, i32*, i32*)*, i32 (%struct._EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL*, i32)*, i32 (%struct._EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL*, i32)*, i32 (%struct._EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL*)*, i32 (%struct._EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL*, i32, i32)*, i32 (%struct._EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL*, i8)*, %struct.EFI_SIMPLE_TEXT_OUTPUT_MODE* }
%struct.EFI_SIMPLE_TEXT_OUTPUT_MODE = type { i32, i32, i32, i32, i32, i8 }

!1 = !DIFile(filename: "hello.c", directory: "/home/hira/Research/HARDEN/harden/Example1/edk2/EmulatorPkg/Example1_Driver_Lockbox", checksumkind: CSK_MD5, checksum: "a49dbb9fa5e3102521f5dee265c87d11")
!2 = !{!3, !11, !18, !36, !41, !44}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 112, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./Uefi/../Uefi/UefiMultiPhase.h", directory: "/home/hira/Research/HARDEN/harden/Example1/edk2/EmulatorPkg/Example1_Driver_Lockbox", checksumkind: CSK_MD5, checksum: "1b91450d7999a018fe8ae0f3d044d0dd")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10}
!7 = !DIEnumerator(name: "EfiResetCold", value: 0)
!8 = !DIEnumerator(name: "EfiResetWarm", value: 1)
!9 = !DIEnumerator(name: "EfiResetShutdown", value: 2)
!10 = !DIEnumerator(name: "EfiResetPlatformSpecific", value: 3)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 28, baseType: !5, size: 32, elements: !13)
!12 = !DIFile(filename: "./Uefi/UefiSpec.h", directory: "/home/hira/Research/HARDEN/harden/Example1/edk2/EmulatorPkg/Example1_Driver_Lockbox", checksumkind: CSK_MD5, checksum: "e3bf43bf827e1f73dbc649ec717ec761")
!13 = !{!14, !15, !16, !17}
!14 = !DIEnumerator(name: "AllocateAnyPages", value: 0)
!15 = !DIEnumerator(name: "AllocateMaxAddress", value: 1)
!16 = !DIEnumerator(name: "AllocateAddress", value: 2)
!17 = !DIEnumerator(name: "MaxAllocateType", value: 3)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 38, baseType: !5, size: 32, elements: !19)
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35}
!20 = !DIEnumerator(name: "EfiReservedMemoryType", value: 0)
!21 = !DIEnumerator(name: "EfiLoaderCode", value: 1)
!22 = !DIEnumerator(name: "EfiLoaderData", value: 2)
!23 = !DIEnumerator(name: "EfiBootServicesCode", value: 3)
!24 = !DIEnumerator(name: "EfiBootServicesData", value: 4)
!25 = !DIEnumerator(name: "EfiRuntimeServicesCode", value: 5)
!26 = !DIEnumerator(name: "EfiRuntimeServicesData", value: 6)
!27 = !DIEnumerator(name: "EfiConventionalMemory", value: 7)
!28 = !DIEnumerator(name: "EfiUnusableMemory", value: 8)
!29 = !DIEnumerator(name: "EfiACPIReclaimMemory", value: 9)
!30 = !DIEnumerator(name: "EfiACPIMemoryNVS", value: 10)
!31 = !DIEnumerator(name: "EfiMemoryMappedIO", value: 11)
!32 = !DIEnumerator(name: "EfiMemoryMappedIOPortSpace", value: 12)
!33 = !DIEnumerator(name: "EfiPalCode", value: 13)
!34 = !DIEnumerator(name: "EfiPersistentMemory", value: 14)
!35 = !DIEnumerator(name: "EfiMaxMemoryType", value: 15)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 505, baseType: !5, size: 32, elements: !37)
!37 = !{!38, !39, !40}
!38 = !DIEnumerator(name: "TimerCancel", value: 0)
!39 = !DIEnumerator(name: "TimerPeriodic", value: 1)
!40 = !DIEnumerator(name: "TimerRelative", value: 2)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 1143, baseType: !5, size: 32, elements: !42)
!42 = !{!43}
!43 = !DIEnumerator(name: "EFI_NATIVE_INTERFACE", value: 0)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 1459, baseType: !5, size: 32, elements: !45)
!45 = !{!46, !47, !48}
!46 = !DIEnumerator(name: "AllHandles", value: 0)
!47 = !DIEnumerator(name: "ByRegisterNotify", value: 1)
!48 = !DIEnumerator(name: "ByProtocol", value: 2)
!49 = !{i32 7, !"Dwarf Version", i32 5}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = !{i32 7, !"PIC Level", i32 2}
!53 = !{i32 7, !"PIE Level", i32 2}
!54 = !{i32 7, !"uwtable", i32 1}
!55 = !{i32 7, !"frame-pointer", i32 2}
!56 = !{!"Ubuntu clang version 14.0.6"}
!57 = distinct !DISubprogram(name: "UefiMain", scope: !1, file: !1, line: 6, type: !58, scopeLine: 7, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !581)
!58 = !DISubroutineType(types: !59)
!59 = !{!60, !67, !69}
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STATUS", file: !61, line: 28, baseType: !62)
!61 = !DIFile(filename: "./Uefi/UefiBaseType.h", directory: "/home/hira/Research/HARDEN/harden/Example1/edk2/EmulatorPkg/Example1_Driver_Lockbox", checksumkind: CSK_MD5, checksum: "df241735892a54f674fa0b6db424dab3")
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "RETURN_STATUS", file: !63, line: 922, baseType: !64)
!63 = !DIFile(filename: "./Uefi/../Base.h", directory: "/home/hira/Research/HARDEN/harden/Example1/edk2/EmulatorPkg/Example1_Driver_Lockbox", checksumkind: CSK_MD5, checksum: "8b9eb8ac5075fcb1c724769b74e364e0")
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINTN", file: !65, line: 118, baseType: !66)
!65 = !DIFile(filename: "./Arm/ProcessorBind.h", directory: "/home/hira/Research/HARDEN/harden/Example1/edk2/EmulatorPkg/Example1_Driver_Lockbox", checksumkind: CSK_MD5, checksum: "f8db787e5f88cd0fbdb06a604eda4fcf")
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !65, line: 103, baseType: !5)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE", file: !61, line: 32, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SYSTEM_TABLE", file: !12, line: 2037, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 1976, size: 960, elements: !72)
!72 = !{!73, !84, !88, !89, !90, !117, !118, !174, !175, !176, !315, !573, !574}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !71, file: !12, line: 1980, baseType: !74, size: 192)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TABLE_HEADER", file: !4, line: 172, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 145, size: 192, elements: !76)
!76 = !{!77, !80, !81, !82, !83}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !75, file: !4, line: 151, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT64", file: !65, line: 101, baseType: !79)
!79 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !75, file: !4, line: 158, baseType: !66, size: 32, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderSize", scope: !75, file: !4, line: 162, baseType: !66, size: 32, offset: 96)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "CRC32", scope: !75, file: !4, line: 167, baseType: !66, size: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !75, file: !4, line: 171, baseType: !66, size: 32, offset: 160)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "FirmwareVendor", scope: !71, file: !12, line: 1985, baseType: !85, size: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR16", file: !65, line: 106, baseType: !87)
!87 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "FirmwareRevision", scope: !71, file: !12, line: 1990, baseType: !66, size: 32, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ConsoleInHandle", scope: !71, file: !12, line: 1995, baseType: !67, size: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ConIn", scope: !71, file: !12, line: 2000, baseType: !91, size: 64, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_INPUT_PROTOCOL", file: !93, line: 20, baseType: !94)
!93 = !DIFile(filename: "./Uefi/../Protocol/../Protocol/SimpleTextIn.h", directory: "/home/hira/Research/HARDEN/harden/Example1/edk2/EmulatorPkg/Example1_Driver_Lockbox", checksumkind: CSK_MD5, checksum: "239cf4f3dddb25a8596c70fa738413fd")
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SIMPLE_TEXT_INPUT_PROTOCOL", file: !93, line: 116, size: 192, elements: !95)
!95 = !{!96, !103, !115}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !94, file: !93, line: 117, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_RESET", file: !93, line: 86, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!60, !91, !101}
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !65, line: 108, baseType: !102)
!102 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ReadKeyStroke", scope: !94, file: !93, line: 118, baseType: !104, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_READ_KEY", file: !93, line: 107, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!60, !91, !108}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_KEY", file: !93, line: 38, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !93, line: 35, size: 32, elements: !111)
!111 = !{!112, !114}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ScanCode", scope: !110, file: !93, line: 36, baseType: !113, size: 16)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !65, line: 105, baseType: !87)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "UnicodeChar", scope: !110, file: !93, line: 37, baseType: !86, size: 16, offset: 16)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "WaitForKey", scope: !94, file: !93, line: 122, baseType: !116, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EVENT", file: !61, line: 36, baseType: !68)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ConsoleOutHandle", scope: !71, file: !12, line: 2004, baseType: !67, size: 64, offset: 448)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ConOut", scope: !71, file: !12, line: 2009, baseType: !119, size: 64, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL", file: !121, line: 27, baseType: !122)
!121 = !DIFile(filename: "./Uefi/../Protocol/SimpleTextOut.h", directory: "/home/hira/Research/HARDEN/harden/Example1/edk2/EmulatorPkg/Example1_Driver_Lockbox", checksumkind: CSK_MD5, checksum: "685bec042927ad46d31bf42ae7f6ddcd")
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL", file: !121, line: 387, size: 640, elements: !123)
!123 = !{!124, !129, !134, !136, !142, !147, !149, !154, !159, !161}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !122, file: !121, line: 388, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_RESET", file: !121, line: 167, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!60, !119, !101}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "OutputString", scope: !122, file: !121, line: 390, baseType: !130, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_STRING", file: !121, line: 192, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!60, !119, !85}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "TestString", scope: !122, file: !121, line: 391, baseType: !135, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_TEST_STRING", file: !121, line: 213, baseType: !131)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "QueryMode", scope: !122, file: !121, line: 393, baseType: !137, size: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_QUERY_MODE", file: !121, line: 236, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!60, !119, !64, !141, !141}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "SetMode", scope: !122, file: !121, line: 394, baseType: !143, size: 64, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_MODE", file: !121, line: 256, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!60, !119, !64}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "SetAttribute", scope: !122, file: !121, line: 395, baseType: !148, size: 64, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_ATTRIBUTE", file: !121, line: 277, baseType: !144)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ClearScreen", scope: !122, file: !121, line: 397, baseType: !150, size: 64, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_CLEAR_SCREEN", file: !121, line: 295, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!60, !119}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "SetCursorPosition", scope: !122, file: !121, line: 398, baseType: !155, size: 64, offset: 448)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_CURSOR_POSITION", file: !121, line: 318, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!60, !119, !64, !64}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "EnableCursor", scope: !122, file: !121, line: 399, baseType: !160, size: 64, offset: 512)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_ENABLE_CURSOR", file: !121, line: 340, baseType: !126)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !122, file: !121, line: 404, baseType: !162, size: 64, offset: 576)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_OUTPUT_MODE", file: !121, line: 379, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !121, line: 349, size: 192, elements: !165)
!165 = !{!166, !169, !170, !171, !172, !173}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "MaxMode", scope: !164, file: !121, line: 353, baseType: !167, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !65, line: 104, baseType: !168)
!168 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !164, file: !121, line: 362, baseType: !167, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !164, file: !121, line: 366, baseType: !167, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "CursorColumn", scope: !164, file: !121, line: 370, baseType: !167, size: 32, offset: 96)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "CursorRow", scope: !164, file: !121, line: 374, baseType: !167, size: 32, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "CursorVisible", scope: !164, file: !121, line: 378, baseType: !101, size: 8, offset: 160)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "StandardErrorHandle", scope: !71, file: !12, line: 2014, baseType: !67, size: 64, offset: 576)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "StdErr", scope: !71, file: !12, line: 2019, baseType: !119, size: 64, offset: 640)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "RuntimeServices", scope: !71, file: !12, line: 2023, baseType: !177, size: 64, offset: 704)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RUNTIME_SERVICES", file: !12, line: 1855, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 1812, size: 1088, elements: !180)
!180 = !{!181, !182, !212, !217, !223, !228, !244, !250, !268, !273, !278, !283, !289, !303, !310}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !179, file: !12, line: 1816, baseType: !74, size: 192)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "GetTime", scope: !179, file: !12, line: 1821, baseType: !183, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_TIME", file: !12, line: 800, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!60, !187, !205}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIME", file: !61, line: 79, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 67, size: 128, elements: !190)
!190 = !{!191, !192, !194, !195, !196, !197, !198, !199, !200, !203, !204}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Year", scope: !189, file: !61, line: 68, baseType: !113, size: 16)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Month", scope: !189, file: !61, line: 69, baseType: !193, size: 8, offset: 16)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !65, line: 109, baseType: !102)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Day", scope: !189, file: !61, line: 70, baseType: !193, size: 8, offset: 24)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Hour", scope: !189, file: !61, line: 71, baseType: !193, size: 8, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Minute", scope: !189, file: !61, line: 72, baseType: !193, size: 8, offset: 40)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Second", scope: !189, file: !61, line: 73, baseType: !193, size: 8, offset: 48)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Pad1", scope: !189, file: !61, line: 74, baseType: !193, size: 8, offset: 56)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Nanosecond", scope: !189, file: !61, line: 75, baseType: !66, size: 32, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "TimeZone", scope: !189, file: !61, line: 76, baseType: !201, size: 16, offset: 96)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT16", file: !65, line: 107, baseType: !202)
!202 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Daylight", scope: !189, file: !61, line: 77, baseType: !193, size: 8, offset: 112)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Pad2", scope: !189, file: !61, line: 78, baseType: !193, size: 8, offset: 120)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIME_CAPABILITIES", file: !12, line: 783, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 760, size: 96, elements: !208)
!208 = !{!209, !210, !211}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Resolution", scope: !207, file: !12, line: 767, baseType: !66, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Accuracy", scope: !207, file: !12, line: 774, baseType: !66, size: 32, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "SetsToZero", scope: !207, file: !12, line: 782, baseType: !101, size: 8, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "SetTime", scope: !179, file: !12, line: 1822, baseType: !213, size: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_TIME", file: !12, line: 817, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!60, !187}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "GetWakeupTime", scope: !179, file: !12, line: 1823, baseType: !218, size: 64, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_WAKEUP_TIME", file: !12, line: 838, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!60, !222, !222, !187}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "SetWakeupTime", scope: !179, file: !12, line: 1824, baseType: !224, size: 64, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_WAKEUP_TIME", file: !12, line: 860, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!60, !101, !187}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "SetVirtualAddressMap", scope: !179, file: !12, line: 1829, baseType: !229, size: 64, offset: 448)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_VIRTUAL_ADDRESS_MAP", file: !12, line: 311, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!60, !64, !64, !66, !233}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MEMORY_DESCRIPTOR", file: !12, line: 159, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 127, size: 320, elements: !236)
!236 = !{!237, !238, !240, !242, !243}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !235, file: !12, line: 133, baseType: !66, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "PhysicalStart", scope: !235, file: !12, line: 139, baseType: !239, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PHYSICAL_ADDRESS", file: !61, line: 49, baseType: !78)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "VirtualStart", scope: !235, file: !12, line: 145, baseType: !241, size: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_VIRTUAL_ADDRESS", file: !61, line: 54, baseType: !78)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfPages", scope: !235, file: !12, line: 152, baseType: !78, size: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !235, file: !12, line: 158, baseType: !78, size: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertPointer", scope: !179, file: !12, line: 1830, baseType: !245, size: 64, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONVERT_POINTER", file: !12, line: 406, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!60, !64, !249}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "GetVariable", scope: !179, file: !12, line: 1835, baseType: !251, size: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_VARIABLE", file: !12, line: 670, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!60, !85, !255, !267, !141, !68}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GUID", file: !61, line: 24, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUID", file: !63, line: 218, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 213, size: 128, elements: !259)
!259 = !{!260, !261, !262, !263}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Data1", scope: !258, file: !63, line: 214, baseType: !66, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Data2", scope: !258, file: !63, line: 215, baseType: !113, size: 16, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Data3", scope: !258, file: !63, line: 216, baseType: !113, size: 16, offset: 48)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Data4", scope: !258, file: !63, line: 217, baseType: !264, size: 64, offset: 64)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 64, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 8)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextVariableName", scope: !179, file: !12, line: 1836, baseType: !269, size: 64, offset: 640)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_VARIABLE_NAME", file: !12, line: 706, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!60, !141, !85, !255}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "SetVariable", scope: !179, file: !12, line: 1837, baseType: !274, size: 64, offset: 704)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_VARIABLE", file: !12, line: 748, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!60, !85, !255, !66, !64, !68}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextHighMonotonicCount", scope: !179, file: !12, line: 1842, baseType: !279, size: 64, offset: 768)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_HIGH_MONO_COUNT", file: !12, line: 1081, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!60, !267}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ResetSystem", scope: !179, file: !12, line: 1843, baseType: !284, size: 64, offset: 832)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESET_SYSTEM", file: !12, line: 1046, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !288, !60, !64, !68}
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESET_TYPE", file: !4, line: 140, baseType: !3)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "UpdateCapsule", scope: !179, file: !12, line: 1848, baseType: !290, size: 64, offset: 896)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UPDATE_CAPSULE", file: !12, line: 1707, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!60, !294, !64, !239}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CAPSULE_HEADER", file: !12, line: 1653, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 1632, size: 224, elements: !298)
!298 = !{!299, !300, !301, !302}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "CapsuleGuid", scope: !297, file: !12, line: 1636, baseType: !256, size: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderSize", scope: !297, file: !12, line: 1642, baseType: !66, size: 32, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !297, file: !12, line: 1648, baseType: !66, size: 32, offset: 160)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "CapsuleImageSize", scope: !297, file: !12, line: 1652, baseType: !66, size: 32, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "QueryCapsuleCapabilities", scope: !179, file: !12, line: 1849, baseType: !304, size: 64, offset: 960)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_QUERY_CAPSULE_CAPABILITIES", file: !12, line: 1738, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!60, !294, !64, !308, !309}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "QueryVariableInfo", scope: !179, file: !12, line: 1854, baseType: !311, size: 64, offset: 1024)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_QUERY_VARIABLE_INFO", file: !12, line: 1769, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!60, !66, !308, !308, !308}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "BootServices", scope: !71, file: !12, line: 2027, baseType: !316, size: 64, offset: 768)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_BOOT_SERVICES", file: !12, line: 1956, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 1863, size: 3008, elements: !319)
!319 = !{!320, !321, !327, !332, !340, !345, !350, !355, !360, !370, !376, !381, !386, !388, !390, !397, !402, !407, !412, !413, !418, !424, !441, !446, !451, !457, !462, !467, !472, !477, !482, !487, !492, !497, !502, !507, !521, !528, !534, !539, !544, !549, !554, !559, !564}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !318, file: !12, line: 1867, baseType: !74, size: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "RaiseTPL", scope: !318, file: !12, line: 1872, baseType: !322, size: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RAISE_TPL", file: !12, line: 628, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!326, !326}
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TPL", file: !61, line: 40, baseType: !64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "RestoreTPL", scope: !318, file: !12, line: 1873, baseType: !328, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESTORE_TPL", file: !12, line: 640, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !326}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "AllocatePages", scope: !318, file: !12, line: 1878, baseType: !333, size: 64, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_PAGES", file: !12, line: 187, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!60, !337, !338, !64, !339}
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_TYPE", file: !12, line: 46, baseType: !11)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MEMORY_TYPE", file: !4, line: 107, baseType: !18)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "FreePages", scope: !318, file: !12, line: 1879, baseType: !341, size: 64, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FREE_PAGES", file: !12, line: 208, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!60, !239, !64}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "GetMemoryMap", scope: !318, file: !12, line: 1880, baseType: !346, size: 64, offset: 448)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_MEMORY_MAP", file: !12, line: 240, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!60, !141, !233, !141, !141, !267}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "AllocatePool", scope: !318, file: !12, line: 1881, baseType: !351, size: 64, offset: 512)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_POOL", file: !12, line: 269, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!60, !338, !64, !249}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "FreePool", scope: !318, file: !12, line: 1882, baseType: !356, size: 64, offset: 576)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FREE_POOL", file: !12, line: 286, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!60, !68}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEvent", scope: !318, file: !12, line: 1887, baseType: !361, size: 64, offset: 640)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CREATE_EVENT", file: !12, line: 464, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!60, !66, !326, !365, !68, !369}
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EVENT_NOTIFY", file: !12, line: 441, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{null, !116, !68}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "SetTimer", scope: !318, file: !12, line: 1888, baseType: !371, size: 64, offset: 704)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_TIMER", file: !12, line: 538, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!60, !116, !375, !78}
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIMER_DELAY", file: !12, line: 518, baseType: !36)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "WaitForEvent", scope: !318, file: !12, line: 1889, baseType: !377, size: 64, offset: 768)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_WAIT_FOR_EVENT", file: !12, line: 574, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!60, !64, !369, !141}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "SignalEvent", scope: !318, file: !12, line: 1890, baseType: !382, size: 64, offset: 832)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIGNAL_EVENT", file: !12, line: 554, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!60, !116}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "CloseEvent", scope: !318, file: !12, line: 1891, baseType: !387, size: 64, offset: 896)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CLOSE_EVENT", file: !12, line: 590, baseType: !383)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "CheckEvent", scope: !318, file: !12, line: 1892, baseType: !389, size: 64, offset: 960)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CHECK_EVENT", file: !12, line: 606, baseType: !383)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "InstallProtocolInterface", scope: !318, file: !12, line: 1897, baseType: !391, size: 64, offset: 1024)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_PROTOCOL_INTERFACE", file: !12, line: 1172, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!60, !395, !255, !396, !68}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INTERFACE_TYPE", file: !12, line: 1148, baseType: !41)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ReinstallProtocolInterface", scope: !318, file: !12, line: 1898, baseType: !398, size: 64, offset: 1088)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_REINSTALL_PROTOCOL_INTERFACE", file: !12, line: 1222, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!60, !67, !255, !68, !68}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "UninstallProtocolInterface", scope: !318, file: !12, line: 1899, baseType: !403, size: 64, offset: 1152)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UNINSTALL_PROTOCOL_INTERFACE", file: !12, line: 1248, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!60, !67, !255, !68}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "HandleProtocol", scope: !318, file: !12, line: 1900, baseType: !408, size: 64, offset: 1216)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE_PROTOCOL", file: !12, line: 1289, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!60, !67, !255, !249}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !318, file: !12, line: 1901, baseType: !68, size: 64, offset: 1280)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "RegisterProtocolNotify", scope: !318, file: !12, line: 1902, baseType: !414, size: 64, offset: 1344)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_REGISTER_PROTOCOL_NOTIFY", file: !12, line: 1450, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!60, !255, !116, !249}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "LocateHandle", scope: !318, file: !12, line: 1903, baseType: !419, size: 64, offset: 1408)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_HANDLE", file: !12, line: 1499, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!60, !423, !255, !68, !141, !395}
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_SEARCH_TYPE", file: !12, line: 1473, baseType: !44)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "LocateDevicePath", scope: !318, file: !12, line: 1904, baseType: !425, size: 64, offset: 1472)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_DEVICE_PATH", file: !12, line: 1525, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!60, !255, !429, !395}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DEVICE_PATH_PROTOCOL", file: !432, line: 58, baseType: !433)
!432 = !DIFile(filename: "./Library/../Protocol/DevicePath.h", directory: "/home/hira/Research/HARDEN/harden/Example1/edk2/EmulatorPkg/Example1_Driver_Lockbox", checksumkind: CSK_MD5, checksum: "bd75f4e4a58f415956cded2ca9a8d289")
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !432, line: 43, size: 32, elements: !434)
!434 = !{!435, !436, !437}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !433, file: !432, line: 44, baseType: !193, size: 8)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "SubType", scope: !433, file: !432, line: 51, baseType: !193, size: 8, offset: 8)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !433, file: !432, line: 56, baseType: !438, size: 16, offset: 16)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 16, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 2)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "InstallConfigurationTable", scope: !318, file: !12, line: 1905, baseType: !442, size: 64, offset: 1536)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_CONFIGURATION_TABLE", file: !12, line: 1546, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!60, !255, !68}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "LoadImage", scope: !318, file: !12, line: 1910, baseType: !447, size: 64, offset: 1600)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_LOAD", file: !12, line: 897, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!60, !101, !67, !430, !68, !64, !395}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "StartImage", scope: !318, file: !12, line: 1911, baseType: !452, size: 64, offset: 1664)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_START", file: !12, line: 922, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!60, !67, !141, !456}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "Exit", scope: !318, file: !12, line: 1912, baseType: !458, size: 64, offset: 1728)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EXIT", file: !12, line: 950, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!60, !67, !60, !64, !85}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "UnloadImage", scope: !318, file: !12, line: 1913, baseType: !463, size: 64, offset: 1792)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_UNLOAD", file: !12, line: 968, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!60, !67}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ExitBootServices", scope: !318, file: !12, line: 1914, baseType: !468, size: 64, offset: 1856)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EXIT_BOOT_SERVICES", file: !12, line: 984, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!60, !67, !64}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextMonotonicCount", scope: !318, file: !12, line: 1919, baseType: !473, size: 64, offset: 1920)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_MONOTONIC_COUNT", file: !12, line: 1065, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!60, !308}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "Stall", scope: !318, file: !12, line: 1920, baseType: !478, size: 64, offset: 1984)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STALL", file: !12, line: 1000, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!60, !64}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "SetWatchdogTimer", scope: !318, file: !12, line: 1921, baseType: !483, size: 64, offset: 2048)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_WATCHDOG_TIMER", file: !12, line: 1022, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!60, !64, !78, !64, !85}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ConnectController", scope: !318, file: !12, line: 1926, baseType: !488, size: 64, offset: 2112)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONNECT_CONTROLLER", file: !12, line: 345, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!60, !67, !395, !430, !101}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "DisconnectController", scope: !318, file: !12, line: 1927, baseType: !493, size: 64, offset: 2176)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DISCONNECT_CONTROLLER", file: !12, line: 378, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!60, !67, !67, !67}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "OpenProtocol", scope: !318, file: !12, line: 1932, baseType: !498, size: 64, offset: 2240)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL", file: !12, line: 1331, baseType: !499)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!60, !67, !255, !249, !67, !67, !66}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "CloseProtocol", scope: !318, file: !12, line: 1933, baseType: !503, size: 64, offset: 2304)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CLOSE_PROTOCOL", file: !12, line: 1363, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!60, !67, !255, !67, !67}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "OpenProtocolInformation", scope: !318, file: !12, line: 1934, baseType: !508, size: 64, offset: 2368)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL_INFORMATION", file: !12, line: 1397, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!60, !67, !255, !512, !141}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL_INFORMATION_ENTRY", file: !12, line: 1378, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 1373, size: 192, elements: !516)
!516 = !{!517, !518, !519, !520}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "AgentHandle", scope: !515, file: !12, line: 1374, baseType: !67, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ControllerHandle", scope: !515, file: !12, line: 1375, baseType: !67, size: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !515, file: !12, line: 1376, baseType: !66, size: 32, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "OpenCount", scope: !515, file: !12, line: 1377, baseType: !66, size: 32, offset: 160)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ProtocolsPerHandle", scope: !318, file: !12, line: 1939, baseType: !522, size: 64, offset: 2432)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PROTOCOLS_PER_HANDLE", file: !12, line: 1427, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!60, !67, !526, !141}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "LocateHandleBuffer", scope: !318, file: !12, line: 1940, baseType: !529, size: 64, offset: 2496)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_HANDLE_BUFFER", file: !12, line: 1572, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!60, !423, !255, !68, !141, !533}
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "LocateProtocol", scope: !318, file: !12, line: 1941, baseType: !535, size: 64, offset: 2560)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_PROTOCOL", file: !12, line: 1599, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!60, !255, !68, !249}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "InstallMultipleProtocolInterfaces", scope: !318, file: !12, line: 1942, baseType: !540, size: 64, offset: 2624)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_MULTIPLE_PROTOCOL_INTERFACES", file: !12, line: 1197, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!60, !395, null}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "UninstallMultipleProtocolInterfaces", scope: !318, file: !12, line: 1943, baseType: !545, size: 64, offset: 2688)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UNINSTALL_MULTIPLE_PROTOCOL_INTERFACES", file: !12, line: 1267, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!60, !67, null}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "CalculateCrc32", scope: !318, file: !12, line: 1948, baseType: !550, size: 64, offset: 2752)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CALCULATE_CRC32", file: !12, line: 1102, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!60, !68, !64, !267}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "CopyMem", scope: !318, file: !12, line: 1953, baseType: !555, size: 64, offset: 2816)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_COPY_MEM", file: !12, line: 1118, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{null, !68, !68, !64}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "SetMem", scope: !318, file: !12, line: 1954, baseType: !560, size: 64, offset: 2880)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_MEM", file: !12, line: 1134, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{null, !68, !64, !193}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEventEx", scope: !318, file: !12, line: 1955, baseType: !565, size: 64, offset: 2944)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CREATE_EVENT_EX", file: !12, line: 493, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!60, !66, !326, !365, !569, !571, !369}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !256)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfTableEntries", scope: !71, file: !12, line: 2031, baseType: !64, size: 32, offset: 832)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ConfigurationTable", scope: !71, file: !12, line: 2036, baseType: !575, size: 64, offset: 896)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONFIGURATION_TABLE", file: !12, line: 1971, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 1962, size: 192, elements: !578)
!578 = !{!579, !580}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "VendorGuid", scope: !577, file: !12, line: 1966, baseType: !256, size: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "VendorTable", scope: !577, file: !12, line: 1970, baseType: !68, size: 64, offset: 128)
!581 = !{}
!582 = !DILocalVariable(name: "ImageHandle", arg: 1, scope: !57, file: !1, line: 6, type: !67)
!583 = !DILocation(line: 6, column: 42, scope: !57)
!584 = !DILocalVariable(name: "SystemTable", arg: 2, scope: !57, file: !1, line: 6, type: !69)
!585 = !DILocation(line: 6, column: 76, scope: !57)
!586 = !DILocalVariable(name: "InputBuffer", scope: !57, file: !1, line: 10, type: !587)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 16384, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 1024)
!590 = !DILocation(line: 10, column: 10, scope: !57)
!591 = !DILocation(line: 11, column: 22, scope: !57)
!592 = !DILocation(line: 11, column: 3, scope: !57)
!593 = !DILocation(line: 14, column: 25, scope: !57)
!594 = !DILocation(line: 14, column: 3, scope: !57)
!595 = !DILocation(line: 17, column: 3, scope: !57)
!596 = !DILocation(line: 19, column: 3, scope: !57)
!597 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 22, type: !598, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !581)
!598 = !DISubroutineType(types: !599)
!599 = !{!168, !168, !600}
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!603 = !DILocalVariable(name: "argc", arg: 1, scope: !597, file: !1, line: 22, type: !168)
!604 = !DILocation(line: 22, column: 14, scope: !597)
!605 = !DILocalVariable(name: "argv", arg: 2, scope: !597, file: !1, line: 22, type: !600)
!606 = !DILocation(line: 22, column: 27, scope: !597)
!607 = !DILocalVariable(name: "x", scope: !597, file: !1, line: 23, type: !168)
!608 = !DILocation(line: 23, column: 9, scope: !597)
!609 = !DILocalVariable(name: "y", scope: !597, file: !1, line: 23, type: !168)
!610 = !DILocation(line: 23, column: 12, scope: !597)
!611 = !DILocation(line: 25, column: 24, scope: !597)
!612 = !DILocation(line: 25, column: 5, scope: !597)
!613 = !DILocation(line: 26, column: 24, scope: !597)
!614 = !DILocation(line: 26, column: 5, scope: !597)
!615 = !DILocation(line: 28, column: 14, scope: !597)
!616 = !DILocation(line: 28, column: 17, scope: !597)
!617 = !DILocation(line: 28, column: 5, scope: !597)
!618 = !DILocation(line: 30, column: 5, scope: !597)
